[
    {
      "id": "2001",
      "courseWhatyouGet": [
        {
          "title": "Introduction to Digital Product Components & UX Design",
          "desc": "Explore the foundational elements of digital products and the role of UX design in creating user-friendly experiences."
        },
        {
          "title": "Component Length and Order in Page Structure",
          "desc": "Learn how to organize and arrange components effectively, ensuring logical flow and readability on digital product pages."
        },
        {
          "title": "Interactive Form Design and Input Handling",
          "desc": "Understand how to design and manage user input components such as text areas, file pickers, and date/time pickers within forms."
        },
        {
          "title": "Event Actions and Form Interactions",
          "desc": "Study the functionality of form events like popups, redirects, and closing actions to improve user interactions and engagement."
        },
        {
          "title": "CSS Styling for Digital Product Pages",
          "desc": "Gain practical skills in applying CSS to style digital product pages and components, enhancing both aesthetics and user experience."
        }
      ]
    },
    {
      "id": "2002",
      "courseWhatyouGet": [
        {
          "title": "Understanding Digital Product Requirements",
          "desc": "Learn how to define and structure product requirements in alignment with business goals and user needs."
        },
        {
          "title": "User Input Description and Prioritization",
          "desc": "Study how to identify and prioritize input descriptions to ensure they align with functionality and usability."
        },
        {
          "title": "UI/UX Integration and Functional Requirements",
          "desc": "Explore the integration of user interface (UI) and user experience (UX) to ensure effective product development and delivery."
        },
        {
          "title": "Database Relations and Table Structure in Product Design",
          "desc": "Understand how to define and structure database relations to ensure consistency and functionality in the digital product."
        },
        {
          "title": "Creating and Validating User Acceptance Criteria",
          "desc": "Learn how to formulate and validate user acceptance criteria to ensure that the product meets the intended business requirements."
        }
      ]
    },
    {
      "id": "2003",
      "courseWhatyouGet": [
        {
          "title": "Understanding Digital Product Data Flow",
          "desc": "Learn how data flows through digital products and services, impacting both backend operations and frontend user experience."
        },
        {
          "title": "Mastering Database Structures and Relations",
          "desc": "Explore database tables, fields, and the relationships that form the backbone of a digital product's data architecture."
        },
        {
          "title": "Form and Component Data Flow Management",
          "desc": "Understand how forms and components interact with data and how this affects input-output operations, ensuring smooth data flow across the system."
        },
        {
          "title": "Regression Testing for Data Integrity",
          "desc": "Learn the techniques for performing regression tests to verify data accuracy and consistency within evolving digital products."
        },
        {
          "title": "Optimizing Data Handling in Agile Environments",
          "desc": "Master the best practices for managing data flow within agile projects, ensuring continuous improvement and responsiveness to changing business needs."
        }
      ]
    },
    {
      "id": "2004",
      "courseWhatyouGet": [
        {
          "title": "SQL Basics and Database Queries",
          "desc": "Learn the fundamental SQL commands such as SELECT, INSERT, UPDATE, and DELETE to interact with databases effectively."
        },
        {
          "title": "Form and Database Integration",
          "desc": "Understand how to connect forms with databases to ensure seamless data flow and efficient database operations."
        },
        {
          "title": "Using SQL for Data Manipulation",
          "desc": "Gain practical skills in using SQL functions for updating, inserting, and deleting data in your databases."
        },
        {
          "title": "Joins and Relationships in Databases",
          "desc": "Learn how to combine data from multiple tables using SQL JOINs and manage data relationships through primary and foreign keys."
        },
        {
          "title": "Executing and Integrating SQL Queries in Forms",
          "desc": "Discover how to send parameters to SQL queries, run them within forms, and manage the relationship between forms and databases."
        }
      ]
    },
    {
      "id": "2005",
      "courseWhatyouGet": [
        {
          "title": "Introduction to API Basics",
          "desc": "Learn what APIs are, how they work, and their role in connecting applications and services."
        },
        {
          "title": "Data Formats and API Communication",
          "desc": "Explore how APIs use JSON and XML to send and receive data, enabling seamless communication between systems."
        },
        {
          "title": "API Inputs, Outputs, and SQL Integration",
          "desc": "Understand how to handle API inputs and outputs, and use SQL commands like Insert, Update, and Delete within APIs."
        },
        {
          "title": "HTTP Methods and Security in APIs",
          "desc": "Master the use of HTTP methods and implement authentication and authorization for secure API operations."
        },
        {
          "title": "API Documentation and Testing",
          "desc": "Learn best practices for documenting APIs and creating test case scenarios to validate functionality."
        }
      ]
    },
    {
      "id": "2006",
      "courseWhatyouGet": [
        {
          "title": "Creating Data Flow Diagrams (DFD)",
          "desc": "Visualize the movement of data in digital products and services."
        },
        {
          "title": "Integrating UX with Business Process Mapping",
          "desc": "Design seamless user experiences aligned with process automation."
        },
        {
          "title": "Database Design Principles",
          "desc": "Explore data modeling, normalization, and performance optimization for robust systems."
        },
        {
          "title": "Scalability and Security in Product Design",
          "desc": "Learn key strategies to ensure products can scale efficiently and remain secure."
        },
        {
          "title": "Designing APIs for Mobile and Hardware Integration",
          "desc": "Create APIs that connect mobile apps and hardware seamlessly."
        }
      ]
    },
    {
      "id": "2007",
      "courseWhatyouGet": [
        {
          "title": "Understanding Business Requirements",
          "desc": "Exploring key principles of identifying and documenting data-driven business needs."
        },
        {
          "title": "Segmentation and Stakeholder Analysis",
          "desc": "Techniques for grouping stakeholders and analyzing their specific requirements."
        },
        {
          "title": "Competitor Analysis and Value Proposition",
          "desc": "Assessing competitors to craft unique, user-focused solutions."
        },
        {
          "title": "Mapping Data Flows to Digital Services",
          "desc": "Designing related data flows to match business processes with technical implementations."
        },
        {
          "title": "Evaluating Revenue Stoppers and Service Differentiation",
          "desc": "Identifying and mitigating potential blockers to optimize service outcomes."
        }
      ]
    },
    {
      "id": "2008",
      "courseWhatyouGet": [
        {
          "title": "Understanding Financial Statements and Forecasting",
          "desc": "Learn how to interpret financial statements and use them to create forecasts and financial hypotheses."
        },
        {
          "title": "Evaluating Business Models and Risk Factors",
          "desc": "Explore how different business models influence financial outcomes and assess potential risks."
        },
        {
          "title": "Analyzing Period-Based Financial Data",
          "desc": "Understand how to break down financial performance over various periods and analyze trends."
        },
        {
          "title": "Market Entry and Target Audience Financial Considerations",
          "desc": "Learn how to estimate potential customers' financial impact and align revenue expectations with market strategies."
        },
        {
          "title": "Effective Communication of Financial Hypotheses",
          "desc": "Master the art of communicating financial hypotheses clearly to stakeholders and adjust them based on data-driven insights."
        }
      ]
    },
    {
      "id": "2009",
      "courseWhatyouGet": [
        {
          "title": "Creating and Managing a Project Backlog",
          "desc": "Learn how to structure a project backlog using UI Cards and Data Flow Cards to capture and organize all required tasks and features."
        },
        {
          "title": "Task Breakdown and Categorization",
          "desc": "Understand how to break down large tasks into smaller components and categorize them based on complexity and priority for better task management."
        },
        {
          "title": "Estimation Techniques for Task Hours",
          "desc": "Explore various estimation techniques like Parametric, Analogous, and Expert Judgment to calculate accurate task completion times."
        },
        {
          "title": "Managing Change Requests and New Requests",
          "desc": "Learn how to handle change and new requests during sprints without disrupting project timelines or quality."
        },
        {
          "title": "Sprint Planning and Prioritization",
          "desc": "Discover how to prioritize tasks and plan sprints to align with business objectives, ensuring the most critical tasks are completed first."
        }
      ]
    },
    {
      "id": "2010",
      "courseWhatyouGet": [
        {
          "title": "Sprint Planning and Backlog Creation",
          "desc": "Learn how to build a sprint backlog from the product backlog, prioritize tasks, and plan for successful sprint outcomes."
        },
        {
          "title": "Agile Principles and Collaboration Techniques",
          "desc": "Master agile principles and learn techniques to foster collaboration between development, design, and business teams."
        },
        {
          "title": "Tracking Progress with Burndown Charts",
          "desc": "Learn how to use burndown charts to track progress and ensure sprint goals are met on time."
        },
        {
          "title": "Managing and Resolving Roadblocks",
          "desc": "Identify common roadblocks in agile projects and learn strategies to address and resolve them quickly."
        },
        {
          "title": "Effective Retrospectives and Continuous Improvement",
          "desc": "Understand how to conduct retrospectives to analyze sprint performance and identify opportunities for continuous improvement."
        }
      ]
    },
    {
      "id": "2011",
      "courseWhatyouGet": [
        {
          "title": "Building and Leading Agile Teams",
          "desc": "Learn how to build and lead high-performing agile teams, empowering them to collaborate, innovate, and deliver results."
        },
        {
          "title": "Stakeholder Engagement in Agile Projects",
          "desc": "Master the skills needed to engage stakeholders effectively and ensure their expectations are met throughout the project lifecycle."
        },
        {
          "title": "Measuring Team Performance and Productivity",
          "desc": "Explore methods to measure team performance, including metrics for collaboration, delivery, and individual contributions."
        },
        {
          "title": "Scaling Agile in Large Organizations",
          "desc": "Learn how to scale agile practices to large teams and organizations while maintaining flexibility and responsiveness."
        },
        {
          "title": "Advanced Agile Techniques for Complex Projects",
          "desc": "Dive into advanced agile techniques, including Scrum of Scrums and Kanban, to manage complex, large-scale projects."
        }
      ]
    },
    {
      "id": "2012",
      "courseWhatyouGet": [
        {
          "title": "Design Thinking in Product Development",
          "desc": "Learn how to apply design thinking to create innovative, user-centered products that meet both customer needs and business goals."
        },
        {
          "title": "Prototyping and User Testing for Iterative Development",
          "desc": "Understand how to prototype, test with users, and iterate to improve product functionality and design."
        },
        {
          "title": "Product Roadmapping and Prioritization",
          "desc": "Explore methods for creating clear product roadmaps and effectively prioritizing features to deliver maximum value."
        },
        {
          "title": "Agile Product Development Life Cycle",
          "desc": "Understand the agile product development life cycle and how to apply agile methods to each stage of product creation."
        },
        {
          "title": "Building Minimum Viable Products (MVPs)",
          "desc": "Master the art of building MVPs to quickly test ideas, gain user feedback, and iterate on products."
        }
      ]
    },
    {
      "id": "2013",
      "courseWhatyouGet": [
        {
          "title": "Managing Digital Transformation Projects",
          "desc": "Learn how to manage digital transformation projects, including handling legacy systems and leading digital initiatives."
        },
        {
          "title": "AI and Automation in Digital Product Design",
          "desc": "Understand the role of AI and automation in designing efficient, data-driven digital products."
        },
        {
          "title": "Business Intelligence and Data-Driven Decision Making",
          "desc": "Master how to use business intelligence tools to extract actionable insights and drive data-based decision-making."
        },
        {
          "title": "Optimizing the User Journey with Analytics",
          "desc": "Learn how to optimize the user journey using analytics to enhance engagement, retention, and conversion rates."
        },
        {
          "title": "Strategic Marketing and Growth for Digital Products",
          "desc": "Explore digital marketing strategies and how to apply them for the successful growth of digital products."
        }
      ]
    },
    {
      "id": "2014",
      "courseWhatyouGet": [
        {
          "title": "Understanding SEO for Digital Products",
          "desc": "Learn the principles of SEO and how to optimize digital products for search engines to improve visibility."
        },
        {
          "title": "Optimizing User Experience for SEO",
          "desc": "Explore how to align user experience with SEO strategies for better product discoverability and user engagement."
        },
        {
          "title": "Content Strategy for Digital Product Success",
          "desc": "Understand how content strategy drives product visibility and user acquisition in the digital world."
        },
        {
          "title": "Conversion Rate Optimization Techniques",
          "desc": "Learn the best practices for increasing conversion rates through effective design, content, and marketing strategies."
        },
        {
          "title": "Using Data for Continuous SEO Improvement",
          "desc": "Master techniques for measuring and refining your SEO strategy using data to keep improving digital product performance."
        }
      ]
    },
    {
      "id": "2015",
      "courseWhatyouGet": [
        {
          "title": "Introduction to Cloud Computing and Platforms",
          "desc": "Understand cloud computing concepts, services, and deployment models in the context of digital products."
        },
        {
          "title": "Building Scalable Applications with Cloud Services",
          "desc": "Learn how to design and deploy scalable applications using cloud-based services and tools."
        },
        {
          "title": "Data Security and Privacy in the Cloud",
          "desc": "Explore the key concepts of data security and privacy when using cloud platforms for digital products."
        },
        {
          "title": "Cloud-Native Development and Microservices",
          "desc": "Learn how to develop cloud-native applications using microservices for greater flexibility and scalability."
        },
        {
          "title": "Disaster Recovery and Cloud Backup Solutions",
          "desc": "Master the strategies for disaster recovery and ensuring business continuity through effective cloud backup solutions."
        }
      ]
    },
    {
      "id": "2016",
      "courseWhatyouGet": [
        {
          "title": "Building and Deploying Mobile Applications",
          "desc": "Learn how to create and deploy mobile apps using cross-platform frameworks like Flutter and React Native."
        },
        {
          "title": "Mobile Application Security and Best Practices",
          "desc": "Understand security risks in mobile applications and how to protect users and data through best practices."
        },
        {
          "title": "Integrating APIs with Mobile Applications",
          "desc": "Learn how to connect mobile apps with APIs to fetch real-time data and enhance user experiences."
        },
        {
          "title": "Optimizing Performance for Mobile Platforms",
          "desc": "Master techniques for improving performance and responsiveness in mobile applications across platforms."
        },
        {
          "title": "Mobile User Experience and Design",
          "desc": "Explore the principles of mobile UI/UX design to create seamless, user-friendly mobile applications."
        }
      ]
    },
    {
      "id": "2017",
      "courseWhatyouGet": [
        {
          "title": "Introduction to DevOps and Continuous Delivery",
          "desc": "Learn the basics of DevOps practices, including continuous integration and continuous delivery (CI/CD) for faster product deployment."
        },
        {
          "title": "Automated Testing and Continuous Integration",
          "desc": "Master the art of automated testing and how to integrate continuous testing into the development pipeline."
        },
        {
          "title": "Containerization and Orchestration Tools",
          "desc": "Understand how to use containerization tools like Docker and orchestration tools like Kubernetes for scalable application deployment."
        },
        {
          "title": "Managing Infrastructure as Code (IaC)",
          "desc": "Learn how to define and manage infrastructure with code to automate provisioning and scaling using tools like Terraform."
        },
        {
          "title": "Monitoring and Logging in DevOps Environments",
          "desc": "Explore monitoring tools and techniques to ensure the health of your applications and infrastructure in a DevOps environment."
        }
      ]
    },
    {
      "id": "2018",
      "courseWhatyouGet": [
        {
          "title": "Introduction to Data Science",
          "desc": "Learn the foundational concepts of data science, including data wrangling, visualization, and basic statistical analysis."
        },
        {
          "title": "Machine Learning Algorithms and Models",
          "desc": "Understand the basics of machine learning, including supervised and unsupervised learning algorithms and their applications."
        },
        {
          "title": "Data Visualization with Python and R",
          "desc": "Explore how to use Python and R to create powerful visualizations that help uncover insights from data."
        },
        {
          "title": "Data Cleaning and Feature Engineering",
          "desc": "Learn techniques for cleaning raw data and engineering relevant features for machine learning models."
        },
        {
          "title": "Implementing Predictive Analytics with Python",
          "desc": "Master the process of building and deploying predictive models using Python and popular machine learning libraries."
        }
      ]
    }
  ]
  